# MEPAnalytical Segment Class

Source: https://www.revitapidocs.com/2026/64b45968-97cf-a797-09a6-4583ad9069f7.htm

---

| MEPAnalytical Segment Class |
| --- |

Represents an analytical segment of the MEP analytical model. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Analysis MEPAnalyticalSegment

**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class MEPAnalyticalSegment : IDisposable
```

```
Public Class MEPAnalyticalSegment
	Implements IDisposable
```

```
public ref class MEPAnalyticalSegment : IDisposable
```

```
type MEPAnalyticalSegment =
    class
        interface IDisposable
    end
```
The MEPAnalyticalSegment type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Area | The area of the segment profile. |
|  | DemandFlow | The designed flow value, in ft^3/s. |
|  | DomainType | The connector domain type of this segment. |
|  | EndNode | The id of the end analytical node. |
|  | Id | The identity of this segment. |
|  | InnerDiameter | The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OverrideType | The override type of analytical segment pressure loss calculation. |
|  | RevitElementId | The id of the owning Revit element. |
|  | Roughness | The roughness of this segment, in ft. |
|  | SegmentType | The analytical segment type. |
|  | StartNode | The id of the start analytical node. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MEPAnalyticalSegment |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetFlowCharacteristics | Gets all flow characteristics of the segment. |
|  | GetFlowConvergenceCharacteristic | Gets the flow convergence characteristic of the segment. |
|  | GetFlowTransitionCharacteristic | Gets the flow transition characteristic of the segment. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetLossCoefficientOverride | Gets the overridden value of loss coefficient, dimensionless. |
|  | GetNetworkSegmentId | Gets the NetworkSegmentId. |
|  | GetPressureDropOverride | Gets the overidden value of pressuer drop, in kg/(ft\*s^2\). |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | IsSegmentOverridable | Verifies if the segment can be overridden (e.g., the pressure drop of the pump and curve segments are calculated from the network and cannot be overridden). |
|  | SetLossCoefficientOverride | Sets the overridden value of loss coefficient. |
|  | SetOverrideType | Sets the override type of pressure loss calculation. |
|  | SetPressureDropOverride | Sets the overridden value of pressure drop. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Analysis Namespace